Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2025DAG176.atdf
         <register caption="" name="CNENJ" offset="0x880" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIEJ0" />
            <bitfield mask="0x00000002" name="CNIEJ1" />
            <bitfield mask="0x00000004" name="CNIEJ2" />
            <bitfield mask="0x00000008" name="CNIEJ3" />
            <bitfield mask="0x00000010" name="CNIEJ4" />
            <bitfield mask="0x00000020" name="CNIEJ5" />
            <bitfield mask="0x00000040" name="CNIEJ6" />
            <bitfield mask="0x00000080" name="CNIEJ7" />
            <bitfield mask="0x00000100" name="CNIEJ8" />
            <bitfield mask="0x00000200" name="CNIEJ9" />
            <bitfield mask="0x00000400" name="CNIEJ10" />
            <bitfield mask="0x00000800" name="CNIEJ11" />
            <bitfield mask="0x00001000" name="CNIEJ12" />
            <bitfield mask="0x00002000" name="CNIEJ13" />
            <bitfield mask="0x00004000" name="CNIEJ14" />
            <bitfield mask="0x00008000" name="CNIEJ15" />
         </register>
         <register caption="" name="CNENK" offset="0x980" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIEK0" />
            <bitfield mask="0x00000002" name="CNIEK1" />
            <bitfield mask="0x00000004" name="CNIEK2" />
            <bitfield mask="0x00000008" name="CNIEK3" />
            <bitfield mask="0x00000010" name="CNIEK4" />
            <bitfield mask="0x00000020" name="CNIEK5" />
            <bitfield mask="0x00000040" name="CNIEK6" />
            <bitfield mask="0x00000080" name="CNIEK7" />
         </register>
         <register caption="" name="CNSTATA" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATA0" />
            <bitfield mask="0x00000002" name="CNSTATA1" />
            <bitfield mask="0x00000004" name="CNSTATA2" />
            <bitfield mask="0x00000008" name="CNSTATA3" />
            <bitfield mask="0x00000010" name="CNSTATA4" />
            <bitfield mask="0x00000020" name="CNSTATA5" />
            <bitfield mask="0x00000040" name="CNSTATA6" />
            <bitfield mask="0x00000080" name="CNSTATA7" />
            <bitfield mask="0x00000200" name="CNSTATA9" />
            <bitfield mask="0x00000400" name="CNSTATA10" />
            <bitfield mask="0x00004000" name="CNSTATA14" />
            <bitfield mask="0x00008000" name="CNSTATA15" />
         </register>
         <register caption="" name="CNSTATB" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATB0" />
            <bitfield mask="0x00000002" name="CNSTATB1" />
            <bitfield mask="0x00000004" name="CNSTATB2" />
            <bitfield mask="0x00000008" name="CNSTATB3" />
            <bitfield mask="0x00000010" name="CNSTATB4" />
            <bitfield mask="0x00000020" name="CNSTATB5" />
            <bitfield mask="0x00000040" name="CNSTATB6" />
            <bitfield mask="0x00000080" name="CNSTATB7" />
            <bitfield mask="0x00000100" name="CNSTATB8" />
            <bitfield mask="0x00000200" name="CNSTATB9" />
            <bitfield mask="0x00000400" name="CNSTATB10" />
            <bitfield mask="0x00000800" name="CNSTATB11" />
            <bitfield mask="0x00001000" name="CNSTATB12" />
            <bitfield mask="0x00002000" name="CNSTATB13" />
            <bitfield mask="0x00004000" name="CNSTATB14" />
            <bitfield mask="0x00008000" name="CNSTATB15" />
         </register>
         <register caption="" name="CNSTATC" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x00000002" name="CNSTATC1" />
            <bitfield mask="0x00000004" name="CNSTATC2" />
            <bitfield mask="0x00000008" name="CNSTATC3" />
            <bitfield mask="0x00000010" name="CNSTATC4" />
            <bitfield mask="0x00001000" name="CNSTATC12" />
            <bitfield mask="0x00002000" name="CNSTATC13" />
            <bitfield mask="0x00004000" name="CNSTATC14" />
            <bitfield mask="0x00008000" name="CNSTATC15" />
         </register>
         <register caption="" name="CNSTATD" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATD0" />
            <bitfield mask="0x00000002" name="CNSTATD1" />
            <bitfield mask="0x00000004" name="CNSTATD2" />
            <bitfield mask="0x00000008" name="CNSTATD3" />
            <bitfield mask="0x00000010" name="CNSTATD4" />
            <bitfield mask="0x00000020" name="CNSTATD5" />
            <bitfield mask="0x00000040" name="CNSTATD6" />
            <bitfield mask="0x00000080" name="CNSTATD7" />
            <bitfield mask="0x00000200" name="CNSTATD9" />
            <bitfield mask="0x00000400" name="CNSTATD10" />
            <bitfield mask="0x00000800" name="CNSTATD11" />
            <bitfield mask="0x00001000" name="CNSTATD12" />
            <bitfield mask="0x00002000" name="CNSTATD13" />
            <bitfield mask="0x00004000" name="CNSTATD14" />
            <bitfield mask="0x00008000" name="CNSTATD15" />
         </register>
         <register caption="" name="CNSTATE" offset="0x490" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATE0" />
            <bitfield mask="0x00000002" name="CNSTATE1" />
            <bitfield mask="0x00000004" name="CNSTATE2" />
            <bitfield mask="0x00000008" name="CNSTATE3" />
            <bitfield mask="0x00000010" name="CNSTATE4" />
            <bitfield mask="0x00000020" name="CNSTATE5" />
            <bitfield mask="0x00000040" name="CNSTATE6" />
            <bitfield mask="0x00000080" name="CNSTATE7" />
            <bitfield mask="0x00000100" name="CNSTATE8" />
            <bitfield mask="0x00000200" name="CNSTATE9" />
         </register>
         <register caption="" name="CNSTATF" offset="0x590" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATF0" />
            <bitfield mask="0x00000002" name="CNSTATF1" />
            <bitfield mask="0x00000004" name="CNSTATF2" />
            <bitfield mask="0x00000008" name="CNSTATF3" />
            <bitfield mask="0x00000010" name="CNSTATF4" />
            <bitfield mask="0x00000020" name="CNSTATF5" />
            <bitfield mask="0x00000100" name="CNSTATF8" />
            <bitfield mask="0x00001000" name="CNSTATF12" />
            <bitfield mask="0x00002000" name="CNSTATF13" />
         </register>
